package com.atworks.jyj;



public class Day4 {
	
	/* 문제1. public void 메소드를 임의적으로 하나 생성후 생성한메소드안에 sysout을 사용하여 ("메소드호출") 텍스트를 main 메소드를 이용하여 출력하세요. 
	 * */
	
	
	/* 문제2. 메소드하나를 생성하여 for문을 이용하여 system.out을 증감식을 사용하여 메인메소드에 5번 출력하세요 (ex : "1번출력","2번출력","3번출력"...)
	 * */
	
	/* 문제3. 메소드하나를 생상하여 while문을 이용하여 2번문제와 동일하게 출력하세요
	 * */
	
	/* 문제4. 메소드하나를 생성하여 for문을이용하여 서술하세요
	 * 조건1. 7번반복
	 * 조건2. 반복문이 5번째 반복할때 sysout을 이용하여 "5번일때 조건문을 이용해보자!" 를 같이 출력하게 하세요
	 * 조건3. 반복문이 끝나면 알림메세지로 "이름을 입력해주세요." 출력후 Sanner를 이용하여 이름입력받게한후 입력이끝나면 "수고하셨습니다 이름님" 을 출력하세요  
	 * */
	
}
